ee230/C8051F/Examples/C8051F58x_59x/Blinky/C8051F580_defs.h
//-----------------------------------------------------------------------------
// C8051F580_defs.h
//-----------------------------------------------------------------------------
// Copyright 2008, Silicon Laboratories, Inc.
// http://www.silabs.com
//
// Program Description:
//
// Register/bit definitions for the C8051F58x family.
// **Important Note**: The compiler_defs.h header file should be included
// before including this header file.
//
// Target:         C8051F580/1/2/3/4/5/6/7,8/9-F590/1
// Tool chain:     Generic
// Command Line:   None
//
// Release 0.5 - 10 SEP 2011 (GP)
//    - Fixed SFR16 definition for CAN0IF2MC
//
// Release 0.4 - 08 OCT 2010 (TP)
//    - Fixed bit definitions for SCON0
//
// Release 0.3 - 01 APR 2009 (GP)
//    - Added SN0-SN3
//
// Release 0.2 - 29 JUL 2008 (ADT)
//    - Added Timer 4 bit definitions
//
// Release 0.1 - 09 JUL 2008 (GP)
//    - Initial Revision
//
//-----------------------------------------------------------------------------
// Header File Preprocessor Directive
//-----------------------------------------------------------------------------

#ifndef C8051F580_DEFS_H
#define C8051F580_DEFS_H

//-----------------------------------------------------------------------------
// Page 0, Page 1 and Page F Registers
//-----------------------------------------------------------------------------

SFR (P0, 0x80);                        // Port 0 Latch
SFR (SP, 0x81);                        // Stack Pointer
SFR (DPL, 0x82);                       // Data Pointer Low
SFR (DPH, 0x83);                       // Data Pointer High
SFR (SFR0CN, 0x84);                    // SFR Page Control
SFR (SFRNEXT, 0x85);                   // SFR stack next page
SFR (SFRLAST, 0x86);                   // SFR stack last page
SFR (PCON, 0x87);                      // Power Control
SFR (TCON, 0x88);                      // Timer/Counter Control
SFR (TMOD, 0x89);                      // Timer/Counter Mode
SFR (TL0, 0x8A);                       // Timer/Counter 0 Low
SFR (TL1, 0x8B);                       // Timer/Counter 1 Low
SFR (TH0, 0x8C);                       // Timer/Counter 0 High
SFR (TH1, 0x8D);                       // Timer/Counter 1 High
SFR (CKCON, 0x8E);                     // Clock Control
SFR (PSCTL, 0x8F);                     // Program Store R/W Control
SFR (CLKSEL, 0x8F);                    // System clock select
SFR (P1, 0x90);                        // Port 1 Latch
SFR (TMR3CN, 0x91);                    // Timer/Counter 3 Control
SFR (TMR5CN, 0x91);                    // Timer/Counter 5 Control
SFR (TMR3RLL, 0x92);                   // Timer/Counter 3 Reload Low
SFR (TMR5CAPL, 0x92);                  // Timer/Counter 5 Capture Low
SFR (TMR3RLH, 0x93);                   // Timer/Counter 3 Reload High
SFR (TMR5CAPH, 0x93);                  // Timer/Counter 5 Capture High
SFR (TMR3L, 0x94);                     // Timer/Counter 3 Low
SFR (TMR5L, 0x94);                     // Timer/Counter 5 Low
SFR (TMR3H, 0x95);                     // Timer/Counter 3 High
SFR (TMR5H, 0x95);                     // Timer/Counter 5 High
SFR (TMR5CF, 0x96);                    // Timer/Counter 5 Configuration
SFR (CLKMUL, 0x97);                    // Clock Multiplier
SFR (SCON0, 0x98);                     // UART0 Control
SFR (SCON1, 0x98);                     // UART1 Control
SFR (SBUF0, 0x99);                     // UART0 Data Buffer
SFR (SBUF1, 0x99);                     // UART1 Data Buffer
SFR (CPT0CN, 0x9A);                    // Comparator 0 Control
SFR (CPT2CN, 0x9A);                    // Comparator 2 Control
SFR (CPT0MD, 0x9B);                    // Comparator 0 Mode
SFR (CPT2MD, 0x9B);                    // Comparator 2 Mode
SFR (CPT0MX, 0x9C);                    // Comparator 0 Mux
SFR (CPT2MX, 0x9C);                    // Comparator 2 Mux
SFR (CPT1CN, 0x9D);                    // Comparator 1 Control
SFR (CPT1MD, 0x9E);                    // Comparator 0 Mode
SFR (OSCIFIN, 0x9E);                   // Internal Oscillator Fine Control
SFR (CPT1MX, 0x9F);                    // Comparator 1 Mux
SFR (OSCXCN, 0x9F);                    // External Oscillator Control
SFR (P2, 0xA0);                        // Port 2 Latch
SFR (SPI0CFG, 0xA1);                   // SPI0 Configuration
SFR (OSCICN, 0xA1);                    // Internal Oscillator Control
SFR (SPI0CKR, 0xA2);                   // SPI0 Clock rate control
SFR (OSCICRS, 0xA2);                   // Internal Oscillator Coarse Control
SFR (SPI0DAT, 0xA3);                   // SPI0 Data Buffer
SFR (P0MDOUT, 0xA4);                   // Port 0 Output Mode
SFR (P1MDOUT, 0xA5);                   // Port 1 Output Mode
SFR (P2MDOUT, 0xA6);                   // Port 2 Output Mode
SFR (SFRPAGE, 0xA7);                   // SFR Page Select
SFR (IE, 0xA8);                        // Interrupt Enable
SFR (SMOD0, 0xA9);                     // Serial Port 0 Control
SFR (EMI0CN, 0xAA);                    // EMIF Control
SFR (EMI0TC, 0xAA);                    // EMIF Timing control
SFR (SBCON0, 0xAB);                    // UART0 Baud Rate Generator Control
SFR (SBRLL0, 0xAC);                    // UART0 Baud Rate Generator Low
SFR (SBRLH0, 0xAD);                    // UART0 Baud Rate Generator High
SFR (P3MAT, 0xAE);                     // Port 3 Match
SFR (P3MDOUT, 0xAE);                   // Port 3 Mode
SFR (P3MASK, 0xAF);                    // Port 3 Mask
SFR (P4MDOUT, 0xAF);                   // Port 4 Mode
SFR (P3, 0xB0);                        // Port 3 Latch
SFR (P2MAT, 0xB1);                     // Port 2 Match
SFR (P2MASK, 0xB2);                    // Port 2 Mask
SFR (EMI0CF, 0xB2);                    // EMIF Configuration
SFR (P4, 0xB5);                        // Port 4 Latch
SFR (FLSCL, 0xB6);                     // Flash Scale
SFR (FLKEY, 0xB7);                     // Flash access limit
SFR (IP, 0xB8);                        // Interrupt Priority
SFR (SMB0ADR, 0xB9);                   // SMBus0 Slave address
SFR (ADC0TK, 0xBA);                    // ADC0 Tracking Mode Select
SFR (SMB0ADM, 0xBA);                   // SMBus0 Address Mask
SFR (ADC0MX, 0xBB);                    // AMUX0 Channel select
SFR (ADC0CF, 0xBC);                    // AMUX0 Channel configuration
SFR (ADC0L, 0xBD);                     // ADC0 Data Low
SFR (ADC0H, 0xBE);                     // ADC0 Data High
SFR (SMB0CN, 0xC0);                    // SMBus0 Control
SFR (SMB0CF, 0xC1);                    // SMBus0 Configuration
SFR (SMB0DAT, 0xC2);                   // SMBus0 Data
SFR (ADC0GTL, 0xC3);                   // ADC0 Greater-Than Compare Low
SFR (ADC0GTH, 0xC4);                   // ADC0 Greater-Than Compare High
SFR (ADC0LTL, 0xC5);                   // ADC0 Less-Than Compare Word Low
SFR (ADC0LTH, 0xC6);                   // ADC0 Less-Than Compare Word High
SFR (XBR3, 0xC6);                      // Port I/O Crossbar Control 3
SFR (XBR2, 0xC7);                      // Port I/O Crossbar Control 2
SFR (TMR2CN, 0xC8);                    // Timer/Counter 2 Control
SFR (TMR4CN, 0xC8);                    // Timer/Counter 4 Control
SFR (REG0CN, 0xC9);                    // Regulator Control
SFR (LIN0CF, 0xC9);                    // LIN 0 Configuration
SFR (TMR4CF, 0xC9);                    // Timer/Counter 4 Configuration
SFR (TMR2RLL, 0xCA);                   // Timer/Counter 2 Reload Low
SFR (TMR4CAPL, 0xCA);                  // Timer/Counter 4 Capture Low
SFR (TMR2RLH, 0xCB);                   // Timer/Counter 2 Reload High
SFR (TMR4CAPH, 0xCB);                  // Timer/Counter 4 Capture High
SFR (TMR2L, 0xCC);                     // Timer/Counter 2 Low
SFR (TMR4L, 0xCC);                     // Timer/Counter 4 Low
SFR (TMR2H, 0xCD);                     // Timer/Counter 2 High
SFR (TMR4H, 0xCD);                     // Timer/Counter 4 High
SFR (PCA0CPL5, 0xCE);                  // PCA0 Capture 5 Low
SFR (PCA1CPL11, 0xCE);                 // PCA1 Capture 11 Low
SFR (PCA0CPH5, 0xCF);                  // PCA0 Capture 5 High
SFR (PCA1CPH11, 0xCF);                 // PCA1 Capture 11 High
SFR (PSW, 0xD0);                       // Program Status Word
SFR (REF0CN, 0xD1);                    // Voltage Reference Control
SFR (LIN0DAT, 0xD2);                   // LIN0 Data
SFR (LIN0ADR, 0xD3);                   // LIN0 Address
SFR (P0SKIP, 0xD4);                    // Port 0 Skip
SFR (P1SKIP, 0xD5);                    // Port 1 Skip
SFR (P2SKIP, 0xD6);                    // Port 2 Skip
SFR (P3SKIP, 0xD7);                    // Port 3 Skip
SFR (PCA0CN, 0xD8);                    // PCA0 Control
SFR (PCA1CN, 0xD8);                    // PCA1 Control
SFR (PCA0MD, 0xD9);                    // PCA0 Mode
SFR (PCA1MD, 0xD9);                    // PCA1 Mode
SFR (PCA0PWM, 0xD9);                   // PCA0 PWM Control
SFR (PCA0CPM0, 0xDA);                  // PCA0 Module 0 Mode
SFR (PCA1CPM6, 0xDA);                  // PCA1 Module 6 Mode
SFR (PCA1PWM, 0xDA);                   // PCA1 PWM Control
SFR (PCA0CPM1, 0xDB);                  // PCA0 Module 1  Mode
SFR (PCA1CPM7, 0xDB);                  // PCA1 Module 7  Mode
SFR (PCA0CPM2, 0xDC);                  // PCA0 Module 2  Mode
SFR (PCA1CPM8, 0xDC);                  // PCA1 Module 8  Mode
SFR (PCA0CPM3, 0xDD);                  // PCA0 Module 3  Mode
SFR (PCA1CPM9, 0xDD);                  // PCA1 Module 9  Mode
SFR (PCA0CPM4, 0xDE);                  // PCA0 Module 4  Mode
SFR (PCA1CPM10, 0xDE);                  // PCA1 Module 10 Mode
SFR (PCA0CPM5, 0xDF);                  // PCA0 Module 5  Mode
SFR (PCA1CPM11, 0xDF);                  // PCA1 Module 11 Mode
SFR (ACC, 0xE0);                       // Accumulator
SFR (XBR0, 0xE1);                      // Port I/O Crossbar Control 0
SFR (XBR1, 0xE2);                      // Port I/O Crossbar Control 1
SFR (CCH0CN, 0xE3);                    // Cache control
SFR (IT01CF, 0xE4);                    // INT0/INT1 Configuration
SFR (EIE1, 0xE6);                      // Extended Interrupt Enable 2
SFR (EIE2, 0xE7);                      // Extended Interrupt Enable 2
SFR (ADC0CN, 0xE8);                    // ADC0 Control
SFR (PCA0CPL1, 0xE9);                  // PCA0 Capture 1 Low
SFR (PCA1CPL1, 0xE9);                  // PCA1 Capture 7 Low
SFR (PCA0CPH1, 0xEA);                  // PCA0 Capture 1 High
SFR (PCA1CPH1, 0xEA);                  // PCA1 Capture 7 High
SFR (PCA0CPL2, 0xEB);                  // PCA0 Capture 2 Low
SFR (PCA1CPL2, 0xEB);                  // PCA1 Capture 8 Low
SFR (PCA0CPH2, 0xEC);                  // PCA0 Capture 2 High
SFR (PCA1CPH2, 0xEC);                  // PCA1 Capture 8 High
SFR (PCA0CPL3, 0xED);                  // PCA0 Capture 3 Low
SFR (PCA1CPL3, 0xED);                  // PCA1 Capture 9 Low
SFR (PCA0CPH3, 0xEE);                  // PCA0 Capture 3 High
SFR (PCA1CPH3, 0xEE);                  // PCA1 Capture 9 High
SFR (RSTSRC, 0xEF);                    // Reset Source Configuration/Status
SFR (B, 0xF0);                         // B Register
SFR (P0MAT, 0xF1);                     // Port 0 Match
SFR (P0MDIN, 0xF1);                    // Port 0 Input Mode
SFR (P0MASK, 0xF2);                    // Port 0 Mask
SFR (P1MDIN, 0xF2);                    // Port 1 Input Mode
SFR (P1MAT, 0xF3);                     // Port 1 Match
SFR (P2MDIN, 0xF3);                    // Port 2 Input Mode
SFR (P1MASK, 0xF4);                    // Port 1 Mask
SFR (P3MDIN, 0xF4);                    // Port 3 Input Mode
SFR (PSBANK, 0xF5);                    // Program Space Bank Select
SFR (EIP1, 0xF6);                      // External Interrupt Priority 1
SFR (EIP2, 0xF7);                      // External Interrupt Priority 2
SFR (SPI0CN, 0xF8);                    // SPI0 Control
SFR (PCA0L, 0xF9);                     // PCA0 Counter Low
SFR (PCA1L, 0xF9);                     // PCA1 Counter Low
SFR (SN0, 0xF9);                       // Serial Number 0
SFR (PCA0H, 0xFA);                     // PCA0 Counter High
SFR (PCA1H, 0xFA);                     // PCA1 Counter High
SFR (SN1, 0xFA);                       // Serial Number 1
SFR (PCA0CPL0, 0xFB);                  // PCA0 Capture 0 Low
SFR (PCA1CPL6, 0xFB);                  // PCA1 Capture 6 Low
SFR (SN2, 0xFB);                       // Serial Number 2
SFR (PCA0CPH0, 0xFC);                  // PCA0 Capture 0 High
SFR (PCA1CPH6, 0xFC);                  // PCA1 Capture 6 High
SFR (SN3, 0xFC);                       // Serial Number 3
SFR (PCA0CPL4, 0xFD);                  // PCA0 Capture 4 Low
SFR (PCA1CPL10, 0xFD);                 // PCA1 Capture 10 Low
SFR (PCA0CPH4, 0xFE);                  // PCA0 Capture 4 High
SFR (PCA1CPH10, 0xFE);                 // PCA1 Capture 10 High
SFR (VDM0CN, 0xFF);                    // VDD Monitor Control

